# Задание-1:
# Напишите функцию, возвращающую ряд Фибоначчи с n-элемента до m-элемента.
# Первыми элементами ряда считать цифры 1 1

#=====================================================

def fibonacci(n, m):
    fibonacci_serie = []
    def fib(n):
            if n<2:
                return n
            curr  = fib(n-1) + fib(n-2)
            return curr
    for i in range(n, m):
        fibonacci_serie.append(fib(i))
    return fibonacci_serie

#=====================================================

# Задача-2:
# Напишите функцию, сортирующую принимаемый список по возрастанию.
# Для сортировки используйте любой алгоритм (например пузырьковый).
# Для решения данной задачи нельзя использовать встроенную функцию и метод sort()

#=====================================================

def sort_to_max(origin_list):
    new_list = origin_list[:]
    for i in range(1,(len(new_list)-1)):
        for j in range((len(new_list)-i)):
            if int(new_list[j]) > int(new_list[j+1]):
                (new_list[j]), (new_list[j+1]) = (new_list[j+1]), (new_list[j])
    return new_list

sort_to_max([2, 10, -12, 2.5, 20, -11, 4, 4, 0])
#=====================================================

# Задача-3:
# Напишите собственную реализацию стандартной функции filter.
# Разумеется, внутри нельзя использовать саму функцию filter.

#=====================================================

def my_filter(function, iterable):
    new_list =[]
    for i in range(len(iterable)-1):
        if function(iterable[i]):
            new_list.append(iterable[i])
    return new_list

#print(my_filter((lambda x: (x > 0)), [2, 10, -12, 2.5, 20, -11, 4, 4, 0]))

#=====================================================

# Задача-4:
# Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4).
# Определить, будут ли они вершинами параллелограмма.

"""
print("Введите, координаты 4х точек")
a1_x,a1_y = input("Введите координату 1й точки через ',': x,y : ")
a2_x,a2_y = input("Введите координату 1й точки через ',': x,y : ")
a3_x,a3_y = input("Введите координату 1й точки через ',': x,y : ")
a4_x,a4_y = input("Введите координату 1й точки через ',': x,y : ")
"""
a1_x,a1_y = 2,4
a2_x,a2_y = 2,4
a3_x,a3_y = 6,3
a4_x,a4_y = 6,3
#параллелограмм - это четырехугольник противоположные стороны которого попарно равны
if (abs(a1_x - a4_x) == abs(a2_x - a3_x)) and (abs(a1_y - a4_y) == abs(a2_y - a3_y)):
    print ("данные точки являются вершинами параллелограмма")
else:
    print ("данные точки не являются вершинами параллелограмма")
