
# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

#==========================================

import math
l =[1, 2, 4, -5, -6, 2, 8, 9, 10, 25, 3, 8, 7]
l2 = []
i = 0
while i < len(l):
    if l[i]>0:
        a = math.sqrt(l[i])
        b = '%3.3f' %a
        c = b.split('.')
        decimal_part = int(c[1])
        if (decimal_part == 0):
            l2.append(int(c[0]))
    i+=1
print ("исходный список:", l)
print("результат:", l2)

#==========================================

# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

datas_names = {
1:   "первое",
2:   "второе",
3:   "третье",
4:   "четвертое",
5:   "пятое",
6:   "шестое",
7:   "седьмое",
8:   "восьмое",
9:   "девятое",
10:   "десятое",
11:  "одиннадцатое",
12:  "двенадцатое",
13:  "тридцатое",
14:  "четырнадцатое",
15:  "пятнадцатое",
16:  "шестнадцатое",
17:  "семнадцатое",
18:  "восемнадцатое",
19:  "девятнадцатое",
20:  "двадцать",
30:  "тридцать",
}

month_names = {
1:    "января",
2:    "февраля",
3:   "марта",
4:   "апреля",
5:   "мая",
6:   "июня",
7:   "июля",
8:   "августа",
9:   "сентября",
10:  "октября",
11:  "ноября",
12:  "декабря",
}

data = "02.11.2013"
data2 = data.split('.')
day = int(data2[0])
month = int(data2[1])
if (day<20):
    day_text = datas_names[day]
elif ( 20 <= day < 32 ):
    day2 = (int(day/10))*10
    day3 = int(day%10)
    if (day3 == 0):
        day_text = datas_names[day2][:-1] +"ое"
    else:
        day_text = datas_names[day2] +" "+ datas_names[day3]
full_data = day_text +" "+ month_names[month] +" "+ data2[2] +" года"
print ("Дата в формате dd.mm.yyyy:",  data)
print ("Дата в текстовом виде    :",       full_data)

#==========================================

# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

#==========================================

import random
a = []
n = 10
for i in range( n ):
    a.append(random.randint(-100,100))
print (a)
#==========================================

# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут: 
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

#=а)========================================
lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst2 = []
for elem in lst:
    if (not (elem in lst2)):
        lst2.append(elem)
print (lst2)
#=б)========================================
lst = [1, 2, 4, 5, 6, 2, 5, 2]
l = []
lst2 =[]
for i in range (0, len(lst)-1):
    l.append([lst[i], lst.count(lst[i])])
for i in range (0, len(l)-1):
    if (l[i][1]==1):
        lst2.append(l[i][0])
print (lst2)
#==========================================

