
# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

#=========================================================

fruits = ["яблоко", "банан", "киви", "арбуз"]
n_fruits = len(fruits)
i=0
while i < n_fruits:
    print ('%d   %s' % ((i+1), fruits[i]))
    i +=1

#=========================================================

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

#=========================================================

list1 =[1, 2, 4, 5, 6, 2, 5, 2, 10, 25, 3, 8, 7]
list2 =[1, 2, 4, 5, 6, 2, 5, 2]
l1 = set(list1)
l2 = set(list2)
list1a = list(l1 - l2)
print("исходный первый список =", list1)
print("исходный второй список =", list2)
print("элементы первого списка, отсутствующие во втором: ", list1a)

#=========================================================


# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.
#=========================================================

l =[1, 2, 4, 5, 6, 2, 5, 2, 10, 25, 3, 8, 7]
l2 = []
i = 0
while i < len(l):
    a = int(l[i])
    if (a%2):
        l2.append(a*2)
    else:
        l2.append(a/4)
    i+=1
print ("исходный список:", l)
print("результат:", l2)

#=========================================================
