# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами. 
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

#==============================================

L = [2, 10, -12, 2.5, 20, -11, 4, 4, 0]
lres = [x**2 for x in L]

#==============================================

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

#==============================================
L1 = ["Абрикос", "Ананас", "Боярышник", "Гранат", "Груша", "Кизил", "Персик", "Слива", "Фейхоа", "Хурма", "Яяблоко"]
L2 = ["Абрикос", "Киви", "Лайм", "Лимон", "Мандарин", "Авокадо", "Айва", "Алыча", "Боярышник", "Гранат", "Груша"]
lres = [ x for x in L1 for y in L2 if x == y]

#==============================================

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

#==============================================

L = [2, 10, -12, 2.5, 20, 45, -11,39, 4, 4, 0, 12, 24, 9]
lres = [ x for x in L if (x>0) and not(x%3) and (x%4)]

#==============================================
