2018-11-02 13:19:43,236 - Client.py - INFO - Запуск клиентской программы 
2018-11-02 13:19:43,237 - Client.py - INFO - Запрос клиента на подключение к серверу и авторизацию 
2018-11-02 13:19:43,238 - Client.py - INFO - Получение ответа сервера с разрешением или запретом подключения 
2018-11-02 13:19:43,238 - Client.py - INFO - Посылка клиентом сервисного сообщения о присутствии 
2018-11-02 13:19:43,238 - Client.py - INFO - Клиентская программа закрыта 
2018-11-02 16:04:00,582 - Client.py - INFO - Запуск клиентской программы 
2018-11-02 16:04:00,583 - Client.py - INFO - Запрос клиента на подключение к серверу и авторизацию 
2018-11-02 16:04:00,584 - Client.py - INFO - Получение ответа сервера с разрешением или запретом подключения 
2018-11-02 16:04:00,584 - Client.py - INFO - Посылка клиентом сервисного сообщения о присутствии 
2018-11-02 16:04:00,584 - Client.py - INFO - Клиентская программа закрыта 
2018-11-02 16:05:56,675 - Client.py - INFO - Запуск клиентской программы 
2018-11-02 16:05:56,676 - Client.py - INFO - Запрос клиента на подключение к серверу и авторизацию 
2018-11-02 16:05:56,677 - Client.py - INFO - Получение ответа сервера с разрешением или запретом подключения 
2018-11-02 16:05:56,677 - Client.py - INFO - Посылка клиентом сервисного сообщения о присутствии 
2018-11-02 16:05:56,677 - Client.py - INFO - Клиентская программа закрыта 
2018-11-02 16:11:27,586 - Client.py - INFO - Запуск клиентской программы 
2018-11-02 16:11:27,587 - Client.py - INFO - Запрос клиента на подключение к серверу и авторизацию 
2018-11-02 16:11:27,588 - Client.py - INFO - Получение ответа сервера с разрешением или запретом подключения 
2018-11-02 16:11:27,588 - Client.py - INFO - Посылка клиентом сервисного сообщения о присутствии 
2018-11-02 16:11:27,588 - Client.py - INFO - Клиентская программа закрыта 
